---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HostAreaComputed
source: html/68d906bb-c8fc-6768-d277-291d1509fed7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HostAreaComputed Property

"Area"

## Syntax (C#)
```csharp
public static ForgeTypeId HostAreaComputed { get; }
```